DROP DATABASE `light_poweroff`;
CREATE DATABASE `light_poweroff`;

CREATE TABLE `users` 
(
    `user_id`	        int(11) 		NOT NULL AUTO_INCREMENT,
	`user_telegram_id`	int(11)	 		NULL,	
	`group_id`			int(11) 		NULL,
	`region_id`			int(11)  		NULL,
    `first_name`	    varchar(300)	NULL, 
	`last_name`	    	varchar(300)	NULL,
	`username`	   		varchar(300)	NULL,
	`language_code`	    varchar(300)	NULL,
	`notification`	    tinyint(2)		NULL DEFAULT 1,
	`date_added`		datetime 		NOT NULL,
	`date_modified`		timestamp 		NOT NULL DEFAULT CURRENT_TIMESTAMP,
    PRIMARY KEY (`user_id`)
)ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1;

INSERT INTO `users` (`user_id`, `user_telegram_id`, `group_id`, `region_id`, `first_name`, `last_name`, `username`, `language_code`, `date_added`, `date_modified`) VALUES
	('1', '342424234', '1', '1', 'Ivan', 'Ivanov', 'ivan123', 'uk', '1', '2022-12-20 10:00', '2022-12-20 10:00');


CREATE TABLE `cluster` 
(
    `group_id`	int(11)			NOT NULL AUTO_INCREMENT,
    `name`		varchar(300)    NOT NULL,
    PRIMARY KEY (`group_id`)
)ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=4;

INSERT INTO `cluster` (`group_id`, `name`) VALUES
	('1', 'Група 1'),
	('2', 'Група 2'),
	('3', 'Група 3');

CREATE TABLE `regions`
(
    `region_id`	int(11)		  NOT NULL AUTO_INCREMENT,
    `name`		varchar(300)  NOT NULL,
    PRIMARY KEY (`region_id`)
)ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=2;

INSERT INTO `regions` (`region_id`, `name`) VALUES
	('1', 'Львівська');
	  
CREATE TABLE IF NOT EXISTS  `time` 
(
    `time_id`         int(11)		NOT NULL  AUTO_INCREMENT,
    `shutdown_time`   varchar(256)	NOT NULL,
    `power_time`	  varchar(256)  NOT NULL,
    PRIMARY KEY (`time_id`)
)ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=7;

INSERT INTO `time` (`time_id`, `shutdown_time`, `power_time`) VALUES
	('1', '01:00', '05:00'),
	('2', '05:00', '09:00'),
	('3', '09:00', '13:00'),
	('4', '13:00', '17:00'),
	('5', '17:00', '21:00'),
	('6', '21:00', '01:00');

CREATE TABLE `weekdays` 
(
    `weekday_id`  int(11)        NOT NULL	AUTO_INCREMENT,
    `name`        varchar(256)   NOT NULL,
	`short_name`        varchar(256)   NOT NULL,
    PRIMARY KEY (`weekday_id`)
)ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=8;

INSERT INTO `weekdays` (`weekday_id`, `name`, `short_name`) VALUES
	('1', 'Понеділок', 'ПН'),
	('2', 'Вівторок', 'ВТ'),
	('3', 'Середа', 'СР'),
	('4', 'Четвер', 'ЧТ'),
	('5', "П'ятниця", 'ПТ'),
	('6', 'Субота', 'СБ'),
	('7', 'Неділя', 'НД');

CREATE TABLE `status` 
(
    `status_id`	int(11)       NOT NULL AUTO_INCREMENT,
    `name`	    varchar(256)  NOT NULL,
    PRIMARY KEY (`status_id`)
)ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=4;

INSERT INTO `status` (`status_id`, `name`) VALUES
	('1', 'Відключення електроенергії'),
	('2', 'Електроенергія подається'),
	('3', 'Можливе відключення електроенергії за необхідності');

CREATE TABLE `shutdown_schedule` 
(
    `shutdown_schedule_id`	int(11) AUTO_INCREMENT,
	`region_id`  int(11)	NOT NULL,   
    `group_id`	 int(11)	NOT NULL,
    `weekday_id` int(11)	NOT NULL,
    `time_id`    int(11)	NOT NULL,
    `status_id`  int(11)	NOT NULL,
    PRIMARY KEY (`shutdown_schedule_id`)
)ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=127;

INSERT INTO `shutdown_schedule` (`shutdown_schedule_id`,`region_id`, `group_id`, `weekday_id`, `time_id`, `status_id`) VALUES
	('1', '1', '1', '1', '1', '1'),
	('2', '1', '2', '1', '1', '2'),
	('3', '1', '3', '1', '1', '3'),
	('4', '1', '1', '1', '2', '2'),
	('5', '1', '2', '1', '2', '3'),
	('6', '1', '3', '1', '2', '1'),
	('7', '1', '1', '1', '3', '3'),
	('8', '1', '2', '1', '3', '1'),
	('9', '1', '3', '1', '3', '2'),
	('10', '1', '1', '1', '4', '1'),
	('11', '1', '2', '1', '4', '2'),
	('12', '1', '3', '1', '4', '3'),
	('13', '1', '1', '1', '5', '2'),
	('14', '1', '2', '1', '5', '3'),
	('15', '1', '3', '1', '5', '1'),
	('16', '1', '1', '1', '6', '3'),
	('17', '1', '2', '1', '6', '1'),
	('18', '1', '3', '1', '6', '2'),
	('19', '1', '1', '4', '1', '1'),
	('20', '1', '2', '4', '1', '2'),
	('21', '1', '3', '4', '1', '3'),
	('22', '1', '1', '4', '2', '2'),
	('23', '1', '2', '4', '2', '3'),
	('24', '1', '3', '4', '2', '1'),
	('25', '1', '1', '4', '3', '3'),
	('26', '1', '2', '4', '3', '1'),
	('27', '1', '3', '4', '3', '2'),
	('28', '1', '1', '4', '4', '1'),
	('29', '1', '2', '4', '4', '2'),
	('30', '1', '3', '4', '4', '3'),
	('31', '1', '1', '4', '5', '2'),
	('32', '1', '2', '4', '5', '3'),
	('33', '1', '3', '4', '5', '1'),
	('34', '1', '1', '4', '6', '3'),
	('35', '1', '2', '4', '6', '1'),
	('36', '1', '3', '4', '6', '2'),
	('37', '1', '1', '7', '1', '1'),
	('38', '1', '2', '7', '1', '2'),
	('39', '1', '3', '7', '1', '3'),
	('40', '1', '1', '7', '2', '2'),
	('41', '1', '2', '7', '2', '3'),
	('42', '1', '3', '7', '2', '1'),
	('43', '1', '1', '7', '3', '3'),
	('44', '1', '2', '7', '3', '1'),
	('45', '1', '3', '7', '3', '2'),
	('46', '1', '1', '7', '4', '1'),
	('47', '1', '2', '7', '4', '2'),
	('48', '1', '3', '7', '4', '3'),
	('49', '1', '1', '7', '5', '2'),
	('50', '1', '2', '7', '5', '3'),
	('51', '1', '3', '7', '5', '1'),
	('52', '1', '1', '7', '6', '3'),
	('53', '1', '2', '7', '6', '1'),
	('54', '1', '3', '7', '6', '2'),
	('55', '1', '1', '2', '1', '2'),
	('56', '1', '2', '2', '1', '3'),
	('57', '1', '3', '2', '1', '1'),
	('58', '1', '1', '2', '2', '3'),
	('59', '1', '2', '2', '2', '1'),
	('60', '1', '3', '2', '2', '2'),
	('61', '1', '1', '2', '3', '1'),
	('62', '1', '2', '2', '3', '2'),
	('63', '1', '3', '2', '3', '3'),
	('64', '1', '1', '2', '4', '2'),
	('65', '1', '2', '2', '4', '3'),
	('66', '1', '3', '2', '4', '1'),
	('69', '1', '3', '2', '5', '2'),
	('68', '1', '2', '2', '5', '1'),
	('67', '1', '1', '2', '5', '3'),
	('70', '1', '1', '2', '6', '1'),
	('71', '1', '2', '2', '6', '2'),
	('72', '1', '3', '2', '6', '3'),
	('73', '1', '1', '5', '1', '2'),
	('74', '1', '2', '5', '1', '3'),
	('75', '1', '3', '5', '1', '1'),
	('76', '1', '1', '5', '2', '3'),
	('77', '1', '2', '5', '2', '1'),
	('78', '1', '3', '5', '2', '2'),
	('79', '1', '1', '5', '3', '1'),
	('80', '1', '2', '5', '3', '2'),
	('81', '1', '3', '5', '3', '3'),
	('82', '1', '1', '5', '4', '2'),
	('83', '1', '2', '5', '4', '3'),
	('84', '1', '3', '5', '4', '1'),
	('85', '1', '1', '5', '5', '3'),
	('86', '1', '2', '5', '5', '1'),
	('87', '1', '3', '5', '5', '2'),
	('88', '1', '1', '5', '6', '1'),
	('89', '1', '2', '5', '6', '2'),
	('90', '1', '3', '5', '6', '3'),
	('91', '1', '1', '3', '1', '3'),
	('92', '1', '2', '3', '1', '1'),
	('93', '1', '3', '3', '1', '2'),
	('94', '1', '1', '3', '2', '1'),
	('95', '1', '2', '3', '2', '2'),
	('96', '1', '3', '3', '2', '3'),
	('97', '1', '1', '3', '3', '2'),
	('98', '1', '2', '3', '3', '3'),
	('99', '1', '3', '3', '3', '1'),
	('100', '1', '1', '3', '4', '3'),
	('101', '1', '2', '3', '4', '1'),
	('102', '1', '3', '3', '4', '2'),
	('103', '1', '1', '3', '5', '1'),
	('104', '1', '2', '3', '5', '2'),
	('105', '1', '3', '3', '5', '3'),
	('106', '1', '1', '3', '6', '2'),
	('107', '1', '2', '3', '6', '3'),
	('108', '1', '3', '3', '6', '1'),
	('109', '1', '1', '6', '1', '3'),
	('110', '1', '2', '6', '1', '1'),
	('111', '1', '3', '6', '1', '2'),
	('112', '1', '1', '6', '2', '1'),
	('113', '1', '2', '6', '2', '2'),
	('114', '1', '3', '6', '2', '3'),
	('115', '1', '1', '6', '3', '2'),
	('116', '1', '2', '6', '3', '3'),
	('117', '1', '3', '6', '3', '1'),
	('118', '1', '1', '6', '4', '3'),
	('119', '1', '2', '6', '4', '1'),
	('120', '1', '3', '6', '4', '2'),
	('121', '1', '1', '6', '5', '1'),
	('122', '1', '2', '6', '5', '2'),
	('123', '1', '3', '6', '5', '3'),
	('124', '1', '1', '6', '6', '2'),
	('125', '1', '2', '6', '6', '3'),
	('126', '1', '3', '6', '6', '1');